app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
def show
    restaurants = Restaurant.find_by(id: params[:id])

SELECT "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "restaurants" WHERE "restaurants"."id" = ?  [["id", 1]]
---
def destroy
    restaurants = Restaurant.find_by(id: params[:id])
    if restaurants
        render json: restaurants.destroy, status: :ok